const newsData = [
  {
    id: "1",
    title: "اسلام آباد میں دھماکہ، 31 افراد جاں بحق",
    summary: "عینی شاہدین کے مطابق دھماکہ نماز کے دوران ہوا، متعدد زخمی۔",
    content: `
      <p>اسلام آباد کی امام بارگاہ میں جمعہ کی نماز کے دوران دھماکہ ہوا۔</p>
      <p>اس دھماکے میں 31 افراد جاں بحق اور 50 سے زائد زخمی ہوئے۔ حکام نے فوری امدادی کارروائیاں شروع کر دی ہیں۔</p>
      <p>متاثرہ افراد کو قریبی ہسپتالوں میں منتقل کیا گیا ہے اور تحقیقات جاری ہیں۔</p>
      <p>    دارالحکومت اسلام آباد کے علاقے ترلائی میں خدیجۃ الکبری مسجد میں دھماکے میں مارے جانے والے 13 افراد کی نماز جنازہ ترلائی کلاں میں ادا کر دی گئی۔  </p>
            <p>  ماز جنازہ میں وفاقی وزراء طارق فضل چودھری، سردار محمد یوسف اور راجہ خرم نواز سمیت شہریوں کی کثیر تعداد نے شرکت کی۔    </p>
                  <p>     س موقعے پر سکیورٹی کے سخت انتظامات کیے گئے اور پولیس، اے ٹی ایس، سی ٹی ڈی کی بھاری نفری تعینات تھی۔ </p>

<p>مازہ جنازہ کی ادائیگی کے بعد میتوں کو ان کے آبائی علاقوں میں تدفین کے لیے روانہ کر دیا گیا۔ </p>
<p> </p>

    `,
    image: "./asset/images/islamabadattck.webp",
    time: "1 گھنٹہ قبل"
  },
  {
    id: "2",
    title: "سعودی عرب نے لاکھوں اونٹوں کو پاسپورٹ جاری کرنے کا فیصلہ",
    summary: "اس اقدام سے اونٹ پالنے کے شعبے میں جدت آئے گی۔",
    content: `
      <p>سعودی حکومت نے اونٹوں کو پاسپورٹ جاری کرنے کا منصوبہ بنایا ہے تاکہ جانوروں کی شناخت ممکن ہو۔</p>
      <p>اس سے اونٹ پالنے والے افراد کو آسانی ہوگی اور بین الاقوامی تجارت میں بہتری آئے گی۔</p>
    <p> سعودی عرب نے اعلان کیا ہے کہ وہ ملک کے لاکھوں اونٹوں کو پاسپورٹ جاری کر رہا ہے، حکام کا کہنا ہے کہ اس اقدام سے ملک کے قیمتی جانوروں کو بہتر طریقے سے سنبھالنے میں مدد ملے گی۔

سعودی حکام کے مطابق اس اقدام سے اونٹ پالنے کے اثرات میں اضافہ ہو گا اور جانوروں کی شناخت اور ملکیت کے حوالے سے ایک قابل اعتماد معلوماتی اثاثہ پیدا ہو گا۔

وزارت ماحولیات، پانی اور زراعت کی جانب سے سوشل میڈیا پر پوسٹ کی گئی ایک ویڈیو میں دستاویز کی تصویر بھی دکھائی گئی۔ اس میں ایک سبز پاسپورٹ دکھایا گیا، جس میں ملک کے کوٹ آف آرمز اور اونٹ کی سنہری تصویر ہے۔

2024 میں، حکومت نے اندازہ لگایا تھا کہ سعودی عرب میں تقریباً 22 لاکھ اونٹ ہیں، جو ہر سال ملک کی معیشت میں 2 ارب ریال سے زیادہ کا حصہ ڈالتے ہیں۔</p>
      `,
    image: "./asset/images/camel.webp",
    time: "2 گھنٹے قبل"
  },
  {
    id: "3",
    title: "کراچی میں بارش، متعدد علاقے زیرِ آب",
    summary: "شدید بارش کے باعث نظامِ زندگی متاثر",
    content: `
      <p> کراچی سمیت سندھ میں مزید بارشوں اور سیلاب کی وارننگ: عام تعطیل کا اعلان اور شہریوں کو گھروں میں رہنے کی ہدایت     </p>
      <p>   قدرتی آفات سے نمٹنے کے قومی ادارے این ڈی ایم اے نے کراچی سمیت سندھ میں شدید بارش اور ممکنہ سیلاب کی وارننگ جاری کی ہے۔ وزیراعلیٰ سندھ سید مراد علی شاہ نے کراچی میں آج عام تعطیل کا اعلان کیا ہے اور عوام کو گھروں میں رہنے کا مشورہ دیا ہے۔   </p>
    
      <p>   وزیراعلیٰ سندھ سید مراد علی شاہ کی زیرصدارت کراچی کی صورتحال پر ہنگامی اجلاس منعقد ہوا۔ اجلاس کے دوران وزیر اعلیٰ کو بریفنگ دی گئی کہ کراچی میں 12 گھنٹے کے دوران سب سے زیادہ 245 ملی میٹر بارش ہوئی،   </p>
   <p>  وزیراعلیٰ سندھ سید مراد علی شاہ کی زیرصدارت کراچی کی صورتحال پر ہنگامی اجلاس منعقد ہوا۔ اجلاس کے دوران وزیر اعلیٰ کو بریفنگ دی گئی کہ کراچی میں 12 گھنٹے کے دوران سب سے زیادہ 245 ملی میٹر بارش ہوئی،

وزیراعلیٰ کو بریفنگ میں بتایا گیا کہ ’بارش کی صورتحال کے باعث ٹریفک کا نظام درہم برہم ہوا، تاہم اہم شاہراہیں کسی حد تک کلیئر کردی گئی ہیں۔‘

وزیراعلیٰ سندھ سید مراد علی شاہ نے کل یعنی بدھ کو کراچی میں عام تعطیل کا اعلان کیا ہے اور عوام کو گھروں میں رہنے کا مشورہ دیا ہے۔

وزیراعلیٰ سندھ نے خبر دار کیا ہے کہ ’مزید بارش کا امکان ہے اس لیے عام تعطیل کی ہے تاکہ عوام کو تکلیف نہ ہو۔‘

اس اجلاس کے بعد وزیراعلیٰ سندھ سید مراد علی شاہ نے کراچی شہر کے دورے کیا۔ ان کے ہمراہ صوبائی وزرا ، میئر اور کمشنر کراچی بھی تھے۔

وزیر اعلیٰ سندھ نے تمام بلدیاتی اداروں اور انتظامیہ کو شہر میں بحالی کے کام جاری رکھنے کی ہدایت کی۔

اس سے پہلے وزیراعلیٰ کو وزیراعظم شہباز شریف نے فون کر کے کراچی اور صوبے کے دیگر شہروں میں بارشوں کے حوالے صورتحال دریافت کی۔    </p>
        `
    ,
    image: "./asset/images/rain.webp",
    time: "4 گھنٹے قبل"
  },
  {
    id: "4",
    title:" اسلام آباد میں مظاہرے",
    summary:'سیاسی صورت حال پر شہریوں میں تشویش',
    content: `
      
<p>
ملک میں سیاسی بنیادوں پر نفرت اور غصہ بڑھنے پر شہریوں نے تشویش کا اظہار کیا ہے۔
</p>

<p>
گیلپ پاکستان کے سروے میں 98 فیصد پاکستانیوں نے سیاسی بنیادوں پر نفرت کم کرنے کی تجویز دی۔
2 فیصد نے سیاسی بنیادوں پر نفرت بڑھنے سے اتفاق نہیں کیا۔
</p>

<p>
سروے کے مطابق اپنی پسندیدہ سیاسی جماعت کو ہر 10 میں سے 9 پاکستانی یعنی 92 فیصد نے
تمام سیاسی جماعتوں میں سب سے زیادہ بہتر کہا، صرف 8 فیصد نے لچک کا مظاہرہ کیا
اور دیگر سیاسی جماعتوں سے بہتر قرار نہیں دیا۔
</p>
    `,
    image: "./asset/images/protest.jpg",
    time: "4 گھنٹے قبل"
  },
  {
    id: "5",
    title: " مسقط مذاکرات پر امریکہ اور ایران دونوں مطمئن، اب آگے کیا ہوگا؟",
    summary: "تجارتی اور دفاعی معاملات پر اختلافات شدت اختیار",
    content: `
      p>
امریکہ کے صدر ڈونلڈ ٹرمپ نے کہا کہ عمان میں ہونے والے مذاکرات ’بہت اچھے‘ رہے اور ایران ’بہت شدت سے معاہدہ چاہتا ہے‘۔
انھوں نے خبردار کیا کہ اگر معاہدہ نہ ہوا تو ’نتائج بہت سخت ہوں گے۔‘
</p>

<p>
جمعے کو عمان میں شروع ہونے والے مذاکرات گذشتہ جون کے بعد پہلی مرتبہ ہیں
جب امریکہ نے ایران کی تین بڑی ایٹمی تنصیبات پر حملہ کیا تھا۔
</p>

<p>
ایرانی وفد کی قیادت وزیرِ خارجہ عباس عراقچی نے کی
جبکہ امریکہ کی نمائندگی خصوصی ایلچی سٹیو وٹکوف
اور صدر ٹرمپ کے داماد جیرڈ کشنر کر رہے تھے۔
</p>

<p>
عمانی وزیرِ خارجہ بدر البوسیدی، جو ان مذاکرات کے ثالث تھے،
نے کہا کہ بات چیت ’مفید رہی اور فریقین کی سوچ کو واضح کرنے میں مدد ملی‘۔
</p>

<p>
ایرانی وزیرِ خارجہ عباس عراقچی نے سوشل میڈیا پلیٹ فارم ایکس پر کہا
کہ مذاکرات ’اچھا آغاز‘ ہیں اور ’مثبت ماحول‘ میں ہوئے۔
انھوں نے بتایا کہ وفود اب مشاورت کے لیے اپنے اپنے دارالحکومت واپس جا رہے ہیں۔
</p>

      
    `,
    image: "./asset/images/iran.webp",
    time: "4 گھنٹے قبل"
  },
  {
    id: "6",
    title:" یورپ میں شدید سردی، نظامِ زندگی متاثر",
    summary:"کئی ممالک میں ایمرجنسی نافذ",
    content: `
      <p>
یورپ بھر میں منجمد کر دینے والے درجۂ حرارت کے باعث کم از کم 20 افراد ہلاک ہو چکے ہیں، جبکہ یونان کے جزیروں سے لے کر اٹلی تک برف کی موٹی چادر بچھ گئی ہے۔
</p>

<p >
اٹلی میں بحری اور فضائی سفر بری طرح متاثر ہوا ہے، جبکہ جنوبی علاقوں میں اسکول پیر تک بند رکھنے کا اعلان کیا گیا ہے۔
</p>

<p >
<strong>روس کے ساحل پر برف کے قدرتی گولے</strong><br>
روس کے بعض ساحلی علاقوں میں برف سے بنے قدرتی گولے بھی دیکھے گئے ہیں جو شدید سردی کی علامت ہیں۔
</p>

<p>
ترکی بھی شدید سرد موسم کی لپیٹ میں ہے۔ استنبول میں برفانی طوفان کے بعد باسفورس کی بندرگاہ کو جہازوں کی آمد و رفت کے لیے بند کر دیا گیا ہے۔
</p>

<p >
پولینڈ میں سردی کے باعث کم از کم 10 افراد ہلاک ہو چکے ہیں، جبکہ روس میں رات کے وقت درجۂ حرارت منفی 30 ڈگری سینٹی گریڈ تک گر گیا ہے۔
</p>

    `,
    image: "./asset/images/winter.webp",
    time: "4 گھنٹے قبل"
  },
  {
    id: "7",
    title: 'ٹی ٹوئنٹی ورلڈکپ میں پاکستان کا فاتحانہ آغاز، نیدرلینڈز کو 3 وکٹوں سے شکست دیدی',
    summary: 'بولرز کی شاندار کارکردگی' ,
       content: `
    <p>
پاکستان کا ٹی ٹوئنٹی ورلڈکپ میں فاتحانہ آغاز، افتتاحی میچ میں نیدرلینڈز کو 3 وکٹوں سے شکست دے دی،
فہیم اشرف نے جارحانہ بیٹنگ کرکے میچ جتوایا، فہیم نے 19ویں اوور میں 3 چھکے، 1 چوکا لگایا،
انہوں نے 11 گیندوں پر 29 رنز کی میچ وننگ اننگز کھیلی۔
</p>

<p>
پاکستان کی جانب سے صاحبزادہ فرحان 47، صائم ایوب 24 رنز بنا کر آؤٹ ہوئے،
بابر اعظم 15، سلمان علی آغا 12 بنا سکے، محمد نواز 6، شاداب خان 8،
عثمان خان صفر پر پویلین لوٹے،
آریان دت اور وین میکرن نے 2-2 کھلاڑیوں کو آؤٹ کیا،
فہیم اشرف میچ کے بہترین کھلاڑی قرار پائے۔
</p>

<p>
نیدرلینڈز کی ٹیم 19.5 اوورز میں 147 رنز بنا کر آؤٹ ہوئی،
کپتان اسکاٹ ایڈورڈ 37 اور باس ڈی لیڈے 30 رنز بنا کر آؤٹ ہوئے،
فاسٹ بولر سلمان مرزا نے 3 شکار کیے،
صائم ایوب، ابرار احمد اور محمد نواز نے 2-2 وکٹیں حاصل کی

          `
    ,
    image: "./asset/images/cricket.jpg",
    time: "4 گھنٹے قبل"
  },
  {
    id: "8",
    title: 'فٹبال ورلڈ کپ کی تیاریاں عروج پر',
    summary: 'ٹیمیں فائنل مرحلے میں داخل',
    content: `
    <p>
قطر میں فٹبال ورلڈ کپ کے فائنل کے بعد فاتح ارجنٹائن کے جشن مناتے کھلاڑیوں اور آفیشلز کے علاوہ
پِچ پر ایک اور جانا پہچانا چہرہ نظر آیا جس کا نہ تو اس میچ سے کوئی تعلق تھا اور نہ ہی ارجنٹائن سے۔
</p>

<p>
سوٹ بوٹ پہنے یہ شخص سب سے ملتے ہوئے تصاویر بنواتا رہا اور حتیٰ کہ ورلڈ کپ کی قیمتی ٹرافی بھی
اس کے ہاتھ لگ گئی جسے صرف چند لمحوں کے لیے اختتامی تقریب کے دوران فاتح کھلاڑیوں کو تھمایا گیا تھا۔
</p>

<p>
فیفا کے قوانین کے تحت کوئی بھی غیر متعلقہ فرد یہ ٹرافی نہیں پکڑ سکتا مگر اس شخص نے نہ صرف
ٹرافی پکڑ کر اس کے ساتھ تصاویر بنوائیں بلکہ اپنے مشہور انداز میں اس پر نمک چھڑکنے کا پوز دیا
اور اسے بوسہ بھی دیا۔
</p>

<p>
پھر کیمرے کے سامنے کسی فاتح اولمپیئن کی طرح فٹبالرز کے گولڈ میڈل کو دانتوں سے بیچ رکھ لیا۔
</p>

<p>
ایسا تاثر

          `
    ,
    image: "./asset/images/footbal.webp",
    time: "4 گھنٹے قبل"
  },
  {
    id: "9",
    title:'نئی خلائی تحقیق سے حیران کن نتائج',
    summary: 'چاند اور مریخ کے بارے میں اہم دریافت',
    content: `
    <p>
ناسا کی جانب سے انسانوں کو تقریباً 50 سال کے بعد چاند پر لے جانے والا پہلا چاند مشن
فروری کے پہلے ہفتے میں روانہ ہو گا۔
</p>

<p>
پچاس سال سے زیادہ عرصے بعد اس انسانی مشن کے لیے ناسا کے دیوہیکل سپیس لانچ سسٹم
ایس ایل ایس مون راکٹ اور اوریون سپیس کیپسول کو فلوریڈا کے لانچ پیڈ پر منتقل کر دیا گیا ہے۔
</p>

<p>
98 میٹر بلند سپیس لانچ سسٹم کو تقریباً بارہ گھنٹوں میں گاڑیوں کی اسمبلی بلڈنگ سے
عمودی حالت میں چار میل (6.5 کلومیٹر) کے سفر کے بعد لانچ پیڈ تک پہنچایا گیا۔
</p>

<p>
10 روزہ آرٹیمس دوم مشن میں چار خلا نوردوں کو چاند کے گرد سفر کا موقع ملے گا،
تاہم روانگی سے قبل اب ایس ایل ایس اور سپیس کیپسول کے حتمی ٹیسٹ، جانچ
اور ایک ’ڈریس ریہرسل‘ کی جائے گی۔
</p>

<p>
ناسا کا کہنا ہے کہ سب سے جلد ممکنہ لانچ کی تاریخ 6 فروری ہے،
تاہم مارچ اور اپریل میں بھی لانچ کے مزید مواقع موجود ہیں۔
</p>


          `
    ,
    image: "./asset/images/space.webp",
    time: "4 گھنٹے قبل"
  },
  {
    id: "10",
    title:'نئی ویکسین سے بیماریوں میں کمی کی توقع',
    summary: 'صحت کے عالمی ادارے نے اہم اعلان کیا',
    content: `
    
<p>
’سرویکل کینسر سے بچاؤ کے لیے ایچ پی وی ویکسین لگوانے سے نہ تو ماہواری ڈسٹرب ہو گی
اور نہ ہی تولیدی صحت متاثر ہو گی بلکہ بچہ پیدا کرنے کی صلاحیت بہتر ہو جائے گی۔‘
</p>

<p>
پاکستان میں 15 ستمبر سے ایچ پی وی ویکسین لگانے کی قومی مہم جاری ہے۔
حکام کے مطابق ملک بھر میں نو سے 14 سال عمر کی لڑکیوں کو سرنج کے ذریعے یہ ویکسین دی جائے گی
تاکہ ان کے اندر ہیومن پیپیلوما وائرس (ایچ پی وی) کے خلاف قوت مدافعت پیدا ہو
اور وہ بچہ دانی کے منہ کے کینسر یعنی سرویکل کینسر سے محفوظ رہ سکیں۔
</p>

<p>
تاہم اس مہم کے آغاز کے ساتھ ہی سوشل میڈیا پر بہت سے سوالات اور غیر تصدیق شدہ معلومات
شیئر کی جانے لگیں اور یوں والدین اور عام شہریوں میں ابہام بھی پیدا ہوتے گئے۔
</p>

<p>
بی بی سی نے گائناکولوجسٹ پروفیسر ڈاکٹر نابیہ طارق کے سامنے
ایچ پی وی ویکسین سے جڑے مفروضوں کو رکھا
تاکہ اس ویکسین سے جڑی غلط فہمیوں کو دور کیا جا سکے۔
</p>

<p>
یاد رہے کہ ماہرین کے مطابق سرویکل یعنی بچہ دانی کے منھ پر بننے والے کینسر کی تشخیص
سکریننگ کے ذریعے ممکن ہے،
تاہم غفلت، تشخیص یا علاج میں تاخیر کے باعث
یہ سب سے جان لیوا کینسرز میں سے ایک ہے۔
</p>

          `
    ,
    image: "./asset/images/vacseen.jpg",
    time: "4 گھنٹے قبل"
  },
];

function getQueryParam(param) {
  const urlParams = new URLSearchParams(window.location.search);
  return urlParams.get(param);
}

const newsId = getQueryParam("id");
const newsSection = document.getElementById("news-detail");
const newsItem = newsData.find(n => n.id === newsId);

if(newsItem){
  newsSection.innerHTML = `
    <div class="news-card">
      <div class="image-container">
        <img src="${newsItem.image}" alt="${newsItem.title}">
      </div>
      <div class="news-content">
        <h2 class="news-title">${newsItem.title}</h2>
        <p class="timestamp">${newsItem.time}</p>
        <p class="news-summary">${newsItem.summary}</p>
        <div class="news-full-content">${newsItem.content}</div>
      </div>
    </div>
  `;
} else {
  newsSection.innerHTML = "<p>معذرت! یہ خبر موجود نہیں ہے۔</p>";
}

// // header + footer load
// fetch('header.html').then(r => r.text()).then(html => document.body.insertAdjacentHTML('afterbegin', html));
// fetch('footer.html').then(r => r.text()).then(html => document.body.insertAdjacentHTML('beforeend', html));
